pass2設計
